au5/app/controllers/devices_controller.rb

  def index
    @devices = Device.all
---
SELECT `devices`.* FROM `devices`

  def create
    @device = Device.new(device_params)

    respond_to do |format|
      if @device.save
---
INSERT INTO `devices` (`ip`, `name`, `description`, `created_at`, `updated_at`, `category`, `owner`) VALUES ('192.168.0.1', 'Home', 'Temp Sensor', '2018-03-01 00:29:09', '2018-03-01 00:29:09', 'Temp Sensor', 'Misfits')

  def update
    respond_to do |format|
      if @device.update(device_params)
---
UPDATE `devices` SET `type` = 'Temperature Sensor', `owner` = 'Misfits', `updated_at` = '2018-03-01 00:10:23' WHERE `devices`.`id` = 1

  def destroy
    @device.destroy
---
DELETE FROM `devices` WHERE `devices`.`id` = 1

    def set_device
      @device = Device.find(params[:id])
---
SELECT  `devices`.* FROM `devices` WHERE `devices`.`id` = 1 LIMIT 1