au5/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`, `password_digest`) VALUES ('test', 'test@example.com', '2018-03-17 22:12:11', '2018-03-17 22:12:11', '$2a$10$HcMQIq8GXDIWoETvqQrGdOnFUANjzACU7nakuK5HZoJrtzfxCI3ie')