app/controllers/devices_controller.rb

INSERT INTO `devices` (`ip`, `name`, `category`, `owner`, `description`, `created_at`, `updated_at`, `switch`) VALUES ('192.168.0.1', 'Cool Device', 'waffle', 'user', '', '2018-03-24 02:51:15', '2018-03-24 02:51:15', 3)
---
  def create
    @device = Device.new(device_params)

    respond_to do |format|
      if @device.save

UPDATE `devices` SET `type` = 'Temperature Sensor', `owner` = 'Misfits', `updated_at` = '2018-03-01 00:10:23' WHERE `devices`.`id` = 1
---
  def update
    respond_to do |format|
      if @device.update(device_params)

DELETE FROM `devices` WHERE `devices`.`id` = 1
---
  def destroy
    @device.destroy

SELECT  `devices`.* FROM `devices` WHERE `devices`.`id` = 3 LIMIT 1
---
    def set_device
      @device = Device.find(params[:id])