app/controllers/requests_controller.rb

  def index
    @requests = Request.all
---
SELECT `requests`.* FROM `requests`

  def create
    @request = Request.new(request_params)

    respond_to do |format|
      if @request.save
---
INSERT INTO `requests` (`title`, `issue`, `created_at`, `updated_at`) VALUES ('Please install air filtration device', 'It\'s allergy season', '2018-03-16 19:00:20', '2018-03-16 19:00:20')

    def set_request
      @request = Request.find(params[:id])
---
SELECT  `requests`.* FROM `requests` WHERE `requests`.`id` = 2 LIMIT 1